-- База данных торговой онлайн площадки Shrimp, ориентированной в первую очередь на пользователя, что хорошо видно из диаграммы, 
-- позволяет хранить информацию о пользователях и их активности, позволяет пользователям обмениваться мнениями о продуктах, 
-- задавать вопросы друг другу и издателю, через соотвествующие темы форума, а так же отслеживать интересующий продукт и получить на него
-- скидку за уровни участника бонусной программы.

-- Хранит и упорядочивает приобретенные пользователем продукты, отслеживает наличие обновлений и новых продуктов. 

-- Предоставляет широкий функционал для размещения цифровых продуктов издателям, позволяет издателю завести специальную страницу, накоторой может разместить информацию о себе, 
-- своих текущий продуктах в статусе релиза, а так же о продуктах, над которыми ведется разработка.

-- Помимо этого, БД позволяет вести аналитику продаж продуктов по регионам, времени, типу самих продуктов и их успешности в рамках торговой площадки.